Шаблоны/409-ERR1_Request.xml

<?xml version="1.0" encoding="utf-8"?>
<soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/" xmlns:wsse="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd" xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd" xmlns:smev="http://smev.gosuslugi.ru/rev120315" xmlns:pfr="http://pfr.skmv.rstyle.com" xmlns:ds="http://www.w3.org/2000/09/xmldsig#" xmlns="http://sum-soc-help.skmv.rstyle.com">
  <soap:Body wsu:Id="body">
    <SumSocHelpRequest>
      <smev:Message>
        <smev:Sender>
          <smev:Code>#SND_CODE#</smev:Code>
          <smev:Name>#SND_NAME#</smev:Name>
        </smev:Sender>
        <smev:Recipient>
          <smev:Code>#SND_CODE#</smev:Code>
          <smev:Name>#SND_NAME#</smev:Name>
        </smev:Recipient>
        <smev:Originator>
          <smev:Code>#SND_CODE#</smev:Code>
          <smev:Name>#SND_NAME#</smev:Name>
        </smev:Originator>
        <smev:ServiceName>TestMnemonic</smev:ServiceName>
        <smev:TypeCode>GSRV</smev:TypeCode>
        <smev:Status>REQUEST</smev:Status>
        <smev:Date>#DATE#</smev:Date>
        <smev:ExchangeType>2</smev:ExchangeType>
        <smev:TestMsg>Test</smev:TestMsg>
	<smev:OKTMO>#OKTMO#</smev:OKTMO>
      </smev:Message>
      <smev:MessageData>
        <smev:AppData>
          <smev:sumSocHelpRequest>
            <fio>
              <pfr:FirstName>Галина</pfr:FirstName>
              <pfr:LastName>Пряхина</pfr:LastName>
              <pfr:Partonymic>Васильевна</pfr:Partonymic>
            </fio>
            <snils>888-888-888 99</snils>
            <gender>F</gender>
            <birthDate>1962-24-18</birthDate>
            <placeBirth>Москва</placeBirth>
            <residenceAddress>
              <index>111111</index>
              <region>Москва</region>
              <area>Тушинский</area>
              <district>Москва</district>
              <street>Свободы</street>
              <house>6</house>
              <housing>7</housing>
              <apartment>8</apartment>
            </residenceAddress>
            <residenceAddressRF>
              <index>111111</index>
              <region>Москва</region>
              <area>Тушинский</area>
              <district>Москва</district>
              <street>Свободы</street>
              <house>6</house>
              <housing>7</housing>
              <apartment>8</apartment>
            </residenceAddressRF>
            <identityDocument>
              <documentType>1</documentType>
              <series>0303</series>
              <number>333333</number>
              <dept>ОВД</dept>
            </identityDocument>
          </smev:sumSocHelpRequest>
        </smev:AppData>
      </smev:MessageData>
    </SumSocHelpRequest>
  </soap:Body>
</soap:Envelope>
